trialWicking/verification/bench_ddtCorr/case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Fluids and porous-medium models as in ../1D_vertical_impes
// (water / air, Brooks-Corey kr n = 3, Van Genuchten pc0 5000 Pa, m 0.5)

phases (wetting nonWetting);

// water: mu 1e-3 Pa.s
wetting
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-6;
    rho             [1 -3 0 0 0 0 0] 1000;
}

// air: mu 1.76e-5 Pa.s, rho 1 (impesFoam phase.a)
nonWetting
{
   transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.76e-5;
    rho             [1 -3 0 0 0 0 0] 1;
}

// only used in solid-free cells (eps > 0.99); none in this case
sigma            [1 0 -2 0 0 0 0]  0.072;

activateCapillarity     1;

// Darcy total flux in porous faces with K/dx^2 below this value (solver
// commits b0c0f67..b995db5 on of9-port, see ../hybridSolverChanges): here
// K/dx^2 = 1e-11/(20 um)^2 = 0.025, so every face is a Darcy face. Without
// this keyword the solver uses the momentum-equation flux as before.
// darcyFaceMaxDa set per run

alpha.wettingmin           alpha.wettingmin [0  0  0 0 0 0 0] 0;
alpha.wettingmax           alpha.wettingmax [0  0  0 0 0 0 0] 0.999;

relativePermeabilityModel  BrooksAndCorey;
capillarityModel           VanGenuchten;

BrooksAndCoreyCoeffs
{
    n 3;
}

// changing pc0, m or alpha.wettingmaxpc changes the p values in 0/p
VanGenuchtenCoeffs
{
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 5000;
    m 0.5;
}

// ************************************************************************* //
