trialWicking/verification/bench_ddtCorr/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Same mesh as ../1D_vertical_impes (1D equivalent of singleYarn_IMPES_vertical):
// x = yarn width 0.55 mm, z = mean thickness 0.237 mm,
// y = centreline length unfolded along the crimp, 3.446 mm; 172 cells of 20 um

convertToMeters 0.001;

vertices
(
    (0 0 0)
    (0.55 0 0)
    (0.55 3.446 0)
    (0 3.446 0)
    (0 0 0.237)
    (0.55 0 0.237)
    (0.55 3.446 0.237)
    (0 3.446 0.237)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (5 172 3) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (1 5 4 0)
    )

    patch outlet
    (
        (3 7 6 2)
    )

    symmetry sides
    (
        (0 4 7 3)
        (0 3 2 1)
        (2 6 5 1)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
